
def area(a):
    '''
        Вычисляет площадь квадрата с заданной стороной.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            area (float): площадь квадрата со стороной a

        >>> area(2)
        <<< 4
    '''
    return a * a


def perimeter(a):
    '''
        Вычисляет периметр квадрата с заданной стороной.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            perimeter (float): периметр квадрата со стороной a 
            
        >>> perimeter(2)
        <<< 8
    '''
    return 4 * a
